import pandas as pd

iphone_df = pd.read_csv('Desktop/iphone.csv', index_col=0)
iphone_df
# --------------------------------------------------------------------------------------------------------------
#	출시일	디스플레이	메모리	출시 버전	Face ID
#iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
#iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
#iPhone 8	2017-09-22	4.7	2GB	iOS 11.0	No
#iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
#iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
#iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
#iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
# --------------------------------------------------------------------------------------------------------------
iphone_df.loc[[True, False, True, True, False, True, False]]
# --------------------------------------------------------------------------------------------------------------
#	출시일	디스플레이	메모리	출시 버전	Face ID
#iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
#iPhone 8	2017-09-22	4.7	2GB	iOS 11.0	No
#iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
#iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
# --------------------------------------------------------------------------------------------------------------
iphone_df['디스플레이'] > 5
# --------------------------------------------------------------------------------------------------------------
#iPhone 7         False
#iPhone 7 Plus     True
#iPhone 8         False
#iPhone 8 Plus     True
#iPhone X          True
#iPhone XS         True
#iPhone XS Max     True
#Name: 디스플레이, dtype: bool
# --------------------------------------------------------------------------------------------------------------
iphone_df.loc[iphone_df['디스플레이']>5]
# --------------------------------------------------------------------------------------------------------------
#	출시일	디스플레이	메모리	출시 버전	Face ID
#iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
#iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
#iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
#iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
#iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
# --------------------------------------------------------------------------------------------------------------
iphone_df['Face ID'] == 'Yes'
# --------------------------------------------------------------------------------------------------------------
#iPhone 7         False
#iPhone 7 Plus    False
#iPhone 8         False
#iPhone 8 Plus    False
#iPhone X          True
#iPhone XS         True
#iPhone XS Max     True
#Name: Face ID, dtype: bool
# --------------------------------------------------------------------------------------------------------------
iphone_df.loc[iphone_df['Face ID'] == 'Yes']
# --------------------------------------------------------------------------------------------------------------
#출시일	디스플레이	메모리	출시 버전	Face ID
#iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
#iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
#iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
# --------------------------------------------------------------------------------------------------------------
condition = (iphone_df['디스플레이']>5) & (iphone_df['Face ID'] == 'Yes')
iphone_df[condition]
# --------------------------------------------------------------------------------------------------------------
#출시일	디스플레이	메모리	출시 버전	Face ID
#iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
#iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
#iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
