import pandas as pd

iphone_df = pd.read_csv('Desktop/iphone.csv', index_col=0)
iphone_df
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
iPhone 8	2017-09-22	4.7	2GB	iOS 11.0	No
iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
----------------------------------------------------------------------------------------------------
"""
iphone_df.loc['iPhone 8', '메모리']
"""
----------------------------------------------------------------------------------------------------
'2GB'
----------------------------------------------------------------------------------------------------
"""
iphone_df.loc['iPhone 8', '메모리'] = '2.5GB'  # 새로운 값 지정(수정)
iphone_df
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
iPhone 8	2017-09-22	4.7	2.5GB	iOS 11.0	No
iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
----------------------------------------------------------------------------------------------------
"""
iphone_df.loc['iPhone 8', '출시 버전'] = 'iOS 10.3'
iphone_df
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
iPhone 8	2017-09-22	4.7	2.5GB	iOS 10.3	No
iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
----------------------------------------------------------------------------------------------------
"""
iphone_df.loc['iPhone 8']
"""
----------------------------------------------------------------------------------------------------
출시일        2017-09-22
디스플레이             4.7
메모리             2.5GB
출시 버전        iOS 10.3
Face ID            No
Name: iPhone 8, dtype: object
----------------------------------------------------------------------------------------------------
"""
iphone_df.loc['iPhone 8'] = ['2016-09-22', '4.7', '2GB', 'iOS 11.0', 'No']  # row를 통째로 수정
iphone_df
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
iPhone 8	2016-09-22	4.7	2GB	iOS 11.0	No
iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
----------------------------------------------------------------------------------------------------
"""
iphone_df['디스플레이']
"""
----------------------------------------------------------------------------------------------------
iPhone 7         4.7
iPhone 7 Plus    5.5
iPhone 8         4.7
iPhone 8 Plus    5.5
iPhone X         5.8
iPhone XS        5.8
iPhone XS Max    6.5
Name: 디스플레이, dtype: object
----------------------------------------------------------------------------------------------------
"""
iphone_df['디스플레이'] = ['4.7 in', '5.5 in', '4.7 in', '5.5 in', '5.8 in', '5.8 in', '6.5 in']
iphone_df  # column을 통째로 수정
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7 in	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5 in	3GB	iOS 10.0	No
iPhone 8	2016-09-22	4.7 in	2GB	iOS 11.0	No
iPhone 8 Plus	2017-09-22	5.5 in	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8 in	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8 in	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5 in	4GB	iOS 12.0	Yes
----------------------------------------------------------------------------------------------------
"""
iphone_df['Face ID']
"""
----------------------------------------------------------------------------------------------------
iPhone 7          No
iPhone 7 Plus     No
iPhone 8          No
iPhone 8 Plus     No
iPhone X         Yes
iPhone XS        Yes
iPhone XS Max    Yes
Name: Face ID, dtype: object
----------------------------------------------------------------------------------------------------
"""
iphone_df['Face ID'] = ['No', 'No', 'No', 'No', 'No', 'No', 'No']
iphone_df
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7 in	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5 in	3GB	iOS 10.0	No
iPhone 8	2016-09-22	4.7 in	2GB	iOS 11.0	No
iPhone 8 Plus	2017-09-22	5.5 in	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8 in	3GB	iOS 11.1	No
iPhone XS	2018-09-21	5.8 in	4GB	iOS 12.0	No
iPhone XS Max	2018-09-21	6.5 in	4GB	iOS 12.0	No
----------------------------------------------------------------------------------------------------
"""
iphone_df['Face ID'] = 'Yes'
iphone_df  # 모두를 단일하게 바꿀 때는 리스트 사용 X도 무방
"""
----------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7 in	2GB	iOS 10.0	Yes
iPhone 7 Plus	2016-09-16	5.5 in	3GB	iOS 10.0	Yes
iPhone 8	2016-09-22	4.7 in	2GB	iOS 11.0	Yes
iPhone 8 Plus	2017-09-22	5.5 in	3GB	iOS 11.0	Yes
iPhone X	2017-11-03	5.8 in	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8 in	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5 in	4GB	iOS 12.0	Yes
----------------------------------------------------------------------------------------------------
"""
