import pandas as pd

iphone_df = pd.read_csv('Desktop/iphone.csv', index_col=0)
iphone_df
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
iPhone 8	2017-09-22	4.7	2GB	iOS 11.0	No
iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
--------------------------------------------------------------------------------------------------------------
"""

iphone_df[['디스플레이', 'Face ID']]  # 디스플레이와 Face ID 열 선택
"""
--------------------------------------------------------------------------------------------------------------
	디스플레이	Face ID
iPhone 7	4.7	No
iPhone 7 Plus	5.5	No
iPhone 8	4.7	No
iPhone 8 Plus	5.5	No
iPhone X	5.8	Yes
iPhone XS	5.8	Yes
iPhone XS Max	6.5	Yes
--------------------------------------------------------------------------------------------------------------
"""

iphone_df[['디스플레이', 'Face ID']] = 'x'
iphone_df  # 두 열의 모든 정보 변경
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	x	2GB	iOS 10.0	x
iPhone 7 Plus	2016-09-16	x	3GB	iOS 10.0	x
iPhone 8	2017-09-22	x	2GB	iOS 11.0	x
iPhone 8 Plus	2017-09-22	x	3GB	iOS 11.0	x
iPhone X	2017-11-03	x	3GB	iOS 11.1	x
iPhone XS	2018-09-21	x	4GB	iOS 12.0	x
iPhone XS Max	2018-09-21	x	4GB	iOS 12.0	x
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.loc[['iPhone 7', 'iPhone X']]  # 'iPhone 7', 'iPhone X' 행 선택
"""
--------------------------------------------------------------------------------------------------------------
출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	x	2GB	iOS 10.0	x
iPhone X	2017-11-03	x	3GB	iOS 11.1	x
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.loc[['iPhone 7', 'iPhone X']] = 'o'
iphone_df  # 두 행의 모든 정보 변경
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	o	o	o	o	o
iPhone 7 Plus	2016-09-16	x	3GB	iOS 10.0	x
iPhone 8	2017-09-22	x	2GB	iOS 11.0	x
iPhone 8 Plus	2017-09-22	x	3GB	iOS 11.0	x
iPhone X	o	o	o	o	o
iPhone XS	2018-09-21	x	4GB	iOS 12.0	x
iPhone XS Max	2018-09-21	x	4GB	iOS 12.0	x
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.loc['iPhone 7':'iPhone X'] = 'o'
iphone_df  # 슬라이싱 사용
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	o	o	o	o	o
iPhone 7 Plus	o	o	o	o	o
iPhone 8	o	o	o	o	o
iPhone 8 Plus	o	o	o	o	o
iPhone X	o	o	o	o	o
iPhone XS	2018-09-21	x	4GB	iOS 12.0	x
iPhone XS Max	2018-09-21	x	4GB	iOS 12.0	x
--------------------------------------------------------------------------------------------------------------
"""

#  조건으로 row 설정 ########################################

iphone_df['디스플레이'] > 5
"""
--------------------------------------------------------------------------------------------------------------
iPhone 7         False
iPhone 7 Plus     True
iPhone 8         False
iPhone 8 Plus     True
iPhone X          True
iPhone XS         True
iPhone XS Max     True
Name: 디스플레이, dtype: bool
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.loc[iphone_df['디스플레이'] > 5]  # 디스플레이가 5 초과인 것들만 출력
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7 Plus	2016-09-16	5.5	3GB	iOS 10.0	No
iPhone 8 Plus	2017-09-22	5.5	3GB	iOS 11.0	No
iPhone X	2017-11-03	5.8	3GB	iOS 11.1	Yes
iPhone XS	2018-09-21	5.8	4GB	iOS 12.0	Yes
iPhone XS Max	2018-09-21	6.5	4GB	iOS 12.0	Yes
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.loc[iphone_df['디스플레이'] > 5] = 'p'
iphone_df  # 디스플레이가 5 초과인 것들의 모든 값들을 p로 변경
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	p	p	p	p	p
iPhone 8	2017-09-22	4.7	2GB	iOS 11.0	No
iPhone 8 Plus	p	p	p	p	p
iPhone X	p	p	p	p	p
iPhone XS	p	p	p	p	p
iPhone XS Max	p	p	p	p	p
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.iloc[[1,3], [1, 4]]  # 1, 3 row와 1, 4 column 출력
"""
--------------------------------------------------------------------------------------------------------------
디스플레이	Face ID
iPhone 7 Plus	p	p
iPhone 8 Plus	p	p
--------------------------------------------------------------------------------------------------------------
"""

iphone_df.iloc[[1,3], [1, 4]] = 'v'
iphone_df
"""
--------------------------------------------------------------------------------------------------------------
	출시일	디스플레이	메모리	출시 버전	Face ID
iPhone 7	2016-09-16	4.7	2GB	iOS 10.0	No
iPhone 7 Plus	p	v	p	p	v
iPhone 8	2017-09-22	4.7	2GB	iOS 11.0	No
iPhone 8 Plus	p	v	p	p	v
iPhone X	p	p	p	p	p
iPhone XS	p	p	p	p	p
iPhone XS Max	p	p	p	p	p
--------------------------------------------------------------------------------------------------------------
"""
