import pandas as pd
laptops_df = pd.read_csv('Desktop/laptops.csv')

laptops_df['brand']  # series로 어떤 brand가 있는지 보기
'''
--------------------------------------------------------------------------------------------------------------
0       Dell
1      Apple
2      Apple
3      Apple
4      Apple
       ...  
162     Asus
163     Asus
164     Asus
165     Asus
166     Asus
Name: brand, Length: 167, dtype: object
--------------------------------------------------------------------------------------------------------------
'''

laptops_df['brand'].unique()  # 겹치는 것 제외하고 총 몇개의 brand가 있는지 보기
'''
--------------------------------------------------------------------------------------------------------------
array(['Dell', 'Apple', 'Acer', 'HP', 'Lenovo', 'Alienware', 'Microsoft',
       'Asus'], dtype=object)
--------------------------------------------------------------------------------------------------------------
'''

laptops_df['brand'].value_counts()  # 각 brand가 몇번씩 나오는지 보기
'''
--------------------------------------------------------------------------------------------------------------
HP           55
Acer         35
Dell         31
Lenovo       18
Asus          9
Apple         7
Alienware     6
Microsoft     6
Name: brand, dtype: int64
--------------------------------------------------------------------------------------------------------------
'''

laptops_df['brand'].describe()  # 167개의 brand, 8가지의 brand, 가장 많이 등장하는 HP는 55번 등장
'''
--------------------------------------------------------------------------------------------------------------
count     167
unique      8
top        HP
freq       55
Name: brand, dtype: object
--------------------------------------------------------------------------------------------------------------
'''
