# 데이터에 해당 국가의 도시가 4개 나왔다는 정보가 있습니다.
# 이 나라는 무엇일까요?

import numpy as np
import pandas as pd

world_cities = pd.read_csv("data/world_cities.csv")

countries = world_cities['Country'].value_counts()  # 어떠한 국가들이 얼마나 등장하는지 세기
'''
--------------------------------------------------------------------------------------------------------------
USA             106
France           15
Brazil           10
Canada            9
               ... 
Vietnam           1
Sudan             1
--------------------------------------------------------------------------------------------------------------
'''

# 이제 여기서 총 4번 등장한 나라를 찾아주면 됩니다.
countries[countries == 4]
'''
--------------------------------------------------------------------------------------------------------------
Italy    4
Name: Country, dtype: int64
--------------------------------------------------------------------------------------------------------------
'''
